using Strategy.Entities;
using System;

namespace Strategy
{
    class Program
    {
        static void Main(string[] args)
        {
            //        ******************************************
            //        *       Принцип проектирования 1:        *
            //        ******************************************
            //        * Выделяйте аспекты приложения, которые  *
            //        * могут изменяться, и отделите их от тех,* 
            //        * которые всегда остаются постоянными    *
            //        ******************************************


            //        ******************************************
            //        *       Принцип проектирования 2:        *
            //        ******************************************
            //        * Программируйте на уровне интерфейса,   * 
            //        * а не на уровне реализации              *
            //        ******************************************


            //        ******************************************
            //        *       Принцип проектирования 3:        *
            //        ******************************************
            //        * Отдавайте предпочтение композиции      * 
            //        * перед наследованием                    *
            //        ******************************************

            Duck mallard = new MallardDuck("MallardDuck");
            mallard.DisplayName();
            mallard.PerformQuack();
            mallard.PerformFly();
            Console.WriteLine("Change quack to squeak");
            mallard.DisplayName();
            mallard.setQuackBehavior(new Squeak());
            mallard.PerformQuack();
            mallard.PerformFly();
        }
    }
}
